/*------------------------应用程序-------------------------------------------*/
#include "def.h"
#include "S3C2416.h"
#include "APPLICATION.H"
/*------------------------函数定义-------------------------------------------*/
extern void Uart_Printf(char *fmt,...);
extern void WatchDogSet(void);
extern unsigned int GetSensor00(void);
extern unsigned int GetSensor01(void);
extern unsigned int GetSensor02(void);
extern unsigned int GetSensor03(void);
extern unsigned int GetSensor04(void);
extern unsigned int GetSensor05(void);
extern unsigned int GetSensor07(void);
extern unsigned int GetSensor08(void);
extern unsigned int GetSensor09(void);
extern void Output00Clr(void);
extern void Output01Clr(void);
extern void Motor220_1_Stop(void);

void Initiate_Parameter(void);

/*------------------------变量声明-------------------------------------------*/
unsigned int TimerCount;
/*定义全局变量*/
unsigned int Timer01;
unsigned int Timer02;
unsigned int Sensor32;


/*1号220V交流电机用的定时器*/
unsigned int Timer220_1_RunMax; /*本次最多转动时间*/
unsigned int Timer220_1_Wait;   /*转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
/*2号220V交流电机用的定时器*/
unsigned int Timer220_2_RunMax; /*本次最多转动时间*/
unsigned int Timer220_2_Wait;   /*转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
/*3号220V交流电机用的定时器*/
unsigned int Timer220_3_RunMax; /*本次最多转动时间*/
unsigned int Timer220_3_Wait;   /*转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
/*4号220V交流电机用的定时器*/
unsigned int Timer220_4_RunMax; /*本次最多转动时间*/
unsigned int Timer220_4_Wait;   /*转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
/*5号220V交流电机用的定时器*/
unsigned int Timer220_5_RunMax; /*本次最多转动时间*/
unsigned int Timer220_5_Wait;   /*转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
/*6号220V交流电机用的定时器*/
unsigned int Timer220_6_RunMax; /*本次最多转动时间*/
unsigned int Timer220_6_Wait;   /*转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
/*7号220V交流电机用的定时器*/
unsigned int Timer220_7_RunMax; /*本次最多转动时间*/
unsigned int Timer220_7_Wait;   /*转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
/*8号220V交流电机用的定时器*/
unsigned int Timer220_8_RunMax; /*本次最多转动时间*/
unsigned int Timer220_8_Wait;   /*转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
/*9号220V交流电机用的定时器*/
unsigned int Timer220_9_RunMax; /*本次最多转动时间*/
unsigned int Timer220_9_Wait;   /*转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
/*---------------------------------------------------------------------------*/
/*应用线程程序的步骤号*/
volatile unsigned int Start;       	/*主程序的步骤号*/
/*假设有2个需要同时初始化的机械部件，这些部件会同时动作，互不影响*/
volatile unsigned int Initiate1Step;	/*机械初始化进程函数1的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
volatile unsigned int Initiate2Step;	/*机械初始化进程函数2的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
volatile unsigned int Initiate3Step;	/*机械初始化进程函数3的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
/*假设有8个需要同时运行的机械部件，这些部件会同时动作，互不影响*/
volatile unsigned int Process1Step;	/*机械运行进程函数1的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
volatile unsigned int Process2Step;	/*机械运行进程函数2的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
volatile unsigned int Process3Step;	/*机械运行进程函数3的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
volatile unsigned int Process4Step;	/*机械运行进程函数4的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
volatile unsigned int Process5Step;	/*机械运行进程函数5的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
volatile unsigned int Process6Step;	/*机械运行进程函数6的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
volatile unsigned int Process7Step;	/*机械运行进程函数7的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
volatile unsigned int Process8Step;	/*机械运行进程函数8的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
void Process_06(void)
{
	switch(Process6Step)
	{
		/*---------------------------------------------------*/
		case 1:
		{
			Process6Step=3;
			break;
		}
		/*---------------------------------------------------*/
		case 3:
		{
			Process6Step=5;	
			break;
		}
		/*---------------------------------------------------*/
		case 5:
		{
			Process6Step=0;	
			break;
		}	
		/*---------------------------------------------------*/
		case 7:
		{
			Process6Step=0;	
			break;
		}			
		/*---------------------------------------------------*/
		case 8:
		{
			Process6Step=0;	
			break;
		}
	}
}
/*---------------------------------------------------------------------------*/
void Process_07(void)
{
	switch(Process7Step)
	{
		/*---------------------------------------------------*/
		case 1:
		{
			Process7Step=3;
			break;
		}
		/*---------------------------------------------------*/
		case 3:
		{
			Process7Step=5;	
			break;
		}
		/*---------------------------------------------------*/
		case 5:
		{
			Process7Step=0;	
			break;
		}	
		/*---------------------------------------------------*/
		case 7:
		{
			Process7Step=0;	
			break;
		}			
		/*---------------------------------------------------*/
		case 8:
		{
			Process7Step=0;	
			break;
		}
	}
}
/*---------------------------------------------------------------------------*/
void Process_08(void)
{
	switch(Process8Step)
	{
		/*---------------------------------------------------*/
		case 1:
		{
			Process8Step=3;
			break;
		}
		/*---------------------------------------------------*/
		case 3:
		{
			Process8Step=5;	
			break;
		}
		/*---------------------------------------------------*/
		case 5:
		{
			Process8Step=0;	
			break;
		}	
		/*---------------------------------------------------*/
		case 7:
		{
			Process8Step=0;	
			break;
		}			
		/*---------------------------------------------------*/
		case 8:
		{
			Process8Step=0;	
			break;
		}
	}
}
/*---------------------------------------------------------------------------*/
/*用户的定时器应用程序，此处的程序每40uS执行一次*/
void Timer(void)
{
	/**********************************************/
	/*下面是测试程序，用户将此部分替换成自己的程序*/
	TimerCount++;
	if (TimerCount % 12500 ==0)
		{
			TimerCount=0;
		Uart_Printf("T");
		rGPBDAT = ~rGPBDAT;  //蜂鸣器响，LED亮
		}
	/*上面是测试程序，用户将此部分替换成自己的程序*/
	/**********************************************/
	/*-------------------------------------------------------------*/
	/*第1部分，给所有的定时器减1*/
	/*----------------------------------------*/
	/*1号220V交流电机一次最多转动时间，到时自动停止*/
	
	if (Timer220_1_RunMax!=0)
	{
		Timer220_1_RunMax--;
		if (Timer220_1_RunMax==0)
		{
			Motor220_1_Stop();
		}
	}
	/*---------------------*/
	/*1号220V交流电机转动前的等待时间，防止正转后立刻反转，或反转后立刻正转*/
	if (Timer220_1_Wait!=0)
	{
		Timer220_1_Wait--;
	}
	/*----------------------------------------*/
	/*----------------------------------------*/
	if (Timer01!=0)
	{
		Timer01--;
	}
	/*----------------------------------------*/
	if (Timer02!=0)
	{
		Timer02--;
	}
	/*-------------------------------------------------------------*/
	/*第2部分，调用机械运行的各个线程程序，因为交替运行，速度很快，感觉并行运行
	这些进程函数如果放在这里，会每40微秒运行一次，所以每个进程函数运行都不能超过40微秒；
	如果进程函数放在主循环的阶段2或阶段3里，每运行一次的时间不确定*/

			/*---------------------*/		
			/*通知下模块纸币到来线程函数6*/
			if ((Process6Step>0)&&(Process6Step<999))
			{
				Process_06();//开启通知下模块纸币到来函数6
			}
			/*---------------------*/		
			/*通知下模块纸币到来线程函数7*/
			if ((Process7Step>0)&&(Process7Step<999))
			{
				Process_07();//开启通知下模块纸币到来函数6
			}
			/*---------------------*/		
			/*通知下模块纸币到来线程函数8*/
			if ((Process8Step>0)&&(Process8Step<999))
			{
				Process_08();//开启通知下模块纸币到来函数6
			}
			/*---------------------*/		
				
// 			/*调用机械运行线程函数1*/
// 			if ((Process1Step>0)&&(Process1Step<999))
// 			{
// 				Process_01();
// 			}
// 			/*---------------------*/		
// 			/*调用机械运行线程函数2*/
// 			if ((Process2Step>0)&&(Process2Step<999))
// 			{
// 				Process_02();
// 			}
			/*---------------------*/		
			/*调用机械运行线程函数3*/
			/*---------------------*/		
			/*调用机械运行线程函数4*/
			/*---------------------*/		
			/*调用机械运行线程函数5*/
			/*---------------------*/		
			/*调用机械运行线程函数6*/
			/*---------------------*/		
			/*调用机械运行线程函数7*/
			/*---------------------*/		
			/*调用机械运行线程函数8*/
			/*---------------------*/		
	/*-------------------------------------------------------------*/
	}
/*---------------------------------------------------------------------------*/
/*测试用延时程序，用户不用，因为此函数会影响多线程执行*/
void delay(uint32 tt)
	{
	uint32 ii,jj;
	for(ii=10000;ii>0;ii--)
		for(jj=tt;jj>0;jj--);	
	}
/*---------------------------------------------------------------------------*/
void Application(void)
{		
	/*临时变量设置*/
//	int Pulses;
	/*-----------------------------------------------------*/
	while(1)
	{
		WatchDogSet();	//喂狗
		/*应用程序：主程序循环，循环一圈的时间不确定*/
		/*-------------------*/
		/*应用层初始化*/
		Initiate_Parameter();
		
		/*---------------------------------------------------*/
		/*设定显示屏的内容*/
		
		/*---------------------------------------------------*/
		/*阶段1：等待用户按动启动按钮*/
		Start=1;
// 		printf("%d\r\n",Start);
		while(Start==1)
		{
			/*-------------------*/
//			if(GPIO_ReadOutputDataBit(GPIOD,GPIO_Pin_0) == 0)
			{
				/*如果用的是串口屏，这里通过串口发一串信息，显示开始初始化*/
				Start=2;                
			}
			WatchDogSet();	//喂狗
		}
		/*---------------------------------------------------*/
		/*读参数：读I2C里的参数*/
		/*-------------------*/
		/*阶段2：初始化机械*/

		/*假设有2个需要同时初始化的机械部件，这些部件会同时动作，互不影响*/
		Initiate1Step=1;				/*设定机械初始化进程函数1运行，即设定 Initiate1Step=1 即可*/
		Initiate2Step=1;				/*设定机械初始化进程函数2运行，即设定 Initiate2Step=1 即可*/
		Initiate3Step=1;				/*设定机械初始化进程函数3运行，即设定 Initiate3Step=1 即可*/
		while(Start==2)					/*等待机械初始化完成*/
		{
			Initiate1Step=10000;				/*设定机械初始化进程函数1运行，即设定 Initiate1Step=1 即可*/
			Initiate2Step=10000;				/*设定机械初始化进程函数2运行，即设定 Initiate2Step=1 即可*/
						
			if ((Initiate1Step==10000)&&(Initiate2Step==10000))	/*机械初始化成功*/
			{						/*设定Start=3，即运行正常机械控制流程*/
				Start=3;
			}
			if ((Initiate1Step==9999)||(Initiate1Step==9999))	/*机械初始化失败*/
			{
				/*----------------------*/
				/*这里需要增加’显示出错信息及处理方法‘的程序*/
				/*如果用的是串口屏，这里通过串口发一串信息，表示报错*/
				
				/*----------------------*/
				Start=1;
			}
			WatchDogSet();	//喂狗
		}
		/*-------------------*/
		/*阶段3：机械运转*/
		if (Start==3)		/*这里Start有可能等于3，也有可能等于1*/
		{
			/*---------------------------*/
			/*设定机械运行线程函数1运行，即设定 Process1Step=1 即可，该进程函数在Timer里调用*/
// 			Process1Step=1;
			/*---------------------------*/
			/*设定机械运行线程函数2运行，即设定 Process2Step=1 即可，该进程函数在Timer里调用*/
// 			Process2Step=1;
			/*---------------------------*/
			/*设定机械运行线程函数3运行，即设定 Process3Step=1 即可，该进程函数在Timer里调用*/
			Process3Step=1; //设定接收磁数据函数运行
			/*---------------------------*/
			/*设定机械运行线程函数4运行，即设定 Process4Step=1 即可，该进程函数在Timer里调用*/
			Process4Step=1; //设定接收厚度数据函数运行
			/*---------------------------*/
			/*设定机械运行线程函数5运行，即设定 Process5Step=1 即可，该进程函数在Timer里调用*/
			Process5Step=1; //设定检测纸币到来函数运行
			/*---------------------------*/
		}
		while (Start==3)
		{
			/*---------------------*/		
			/*如果机械运行进程函数1出错，显示出错信息及处理方法*/
			/*---------------------*/		
			/*如果机械运行进程函数2出错，显示出错信息及处理方法*/
			/*---------------------*/		
			/*如果机械运行进程函数3出错，显示出错信息及处理方法*/
			/*---------------------*/		
			/*如果机械运行进程函数4出错，显示出错信息及处理方法*/
			/*---------------------*/		
			/*如果机械运行进程函数5出错，显示出错信息及处理方法*/
			/*---------------------*/		
			/*如果机械运行进程函数6出错，显示出错信息及处理方法*/
			/*---------------------*/		
			/*如果机械运行进程函数7出错，显示出错信息及处理方法*/
			/*---------------------*/		
			/*如果机械运行进程函数8出错，显示出错信息及处理方法*/
			/*---------------------*/		
 			WatchDogSet();	//喂狗
		}
		/*---------------------------------------------------*/
	}
}
/*---------------------------------------------------------------------------*/
/*应用程序参数初始化*/
void Initiate_Parameter(void)
{
	/*-----------------------------*/
	Initiate1Step=0;	/*机械初始化进程函数1的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
	Initiate2Step=0;	/*机械初始化进程函数2的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
	/*-----------------------------*/
	Process1Step = 0;	/*机械运行进程函数1的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
	Process2Step = 0;	/*机械运行进程函数2的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
	Process3Step = 0;	/*机械运行进程函数3的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
	Process4Step = 0;	/*机械运行进程函数4的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
	Process5Step = 0;	/*机械运行进程函数5的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
	Process6Step = 0;	/*机械运行进程函数6的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
	Process7Step = 0;	/*机械运行进程函数7的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
	Process8Step = 0;	/*机械运行进程函数8的步骤号，记录本线程所处的位置，相当于多任务下当前任务的状态*/
/*---------------------------------------------------------------------------*/
}
